Repository: qwersyk/Newelle
Catalog: po/*.po
Languages: de, hi, ru

source: Include the cleaned and parsed HTML content of each search result.
hi: प्रत्येक खोज परिणाम की साफ और पार्स की गई HTML सामग्री शामिल करें।

source: Include images
hi: छवियाँ शामिल करें

source: Perform an image search and include the results in the response.
hi: एक छवि खोज करें और परिणामों को प्रतिक्रिया में शामिल करें।

source: Include image descriptions
hi: छवि विवरण शामिल करें

source: When Include images is enabled, also add a descriptive text for each image.
hi: जब 'छवियाँ शामिल करें' सक्षम हो, तो प्रत्येक छवि के लिए एक वर्णनात्मक पाठ भी जोड़ें।

source: Include domains
hi: डोमेन शामिल करें

source: A list of domains to specifically include in the search results.
hi: खोज परिणामों में विशेष रूप से शामिल करने के लिए डोमेन की एक सूची।

source: Exclude domains
hi: डोमेन को बाहर करें

source: A list of domains to specifically exclude from the search results.
hi: खोज परिणामों से विशेष रूप से बाहर करने के लिए डोमेन की एक सूची।

source: API base url, change this to use different APIs
hi: API बेस यूआरएल, विभिन्न API का उपयोग करने के लिए इसे बदलें

source: Name of the Embedding Model to use
hi: उपयोग करने के लिए एम्बेडिंग मॉडल का नाम

source: Newelle Demo API
hi: न्युएल डेमो API

source: Any free Provider
hi: कोई भी मुफ्त प्रदाता

source: Local Model
hi: स्थानीय मॉडल

source: NO GPU SUPPORT, USE OLLAMA INSTEAD. Run a LLM model locally, more privacy but slower
hi: GPU समर्थन नहीं, इसके बजाय OLLAMA का उपयोग करें। LLM मॉडल को स्थानीय रूप से चलाएं, अधिक गोपनीयता लेकिन धीमा

source: Ollama Instance
hi: Ollama इंस्टेंस

source: Easily run multiple LLM models on your own hardware
hi: अपने स्वयं के हार्डवेयर पर आसानी से कई LLM मॉडल चलाएं

source: Google Gemini API
hi: गूगल जेमिनी API

source: OpenAI API. Custom endpoints supported. Use this for custom providers
hi: OpenAI API। कस्टम एंडपॉइंट समर्थित। कस्टम प्रदाताओं के लिए इसका उपयोग करें

source: Anthropic Claude
hi: एंथ्रोपिक क्लॉड

source: Official APIs for Anthropic Claude's models, with image and file support, requires an API key
hi: एंथ्रोपिक क्लॉड के मॉडल के लिए आधिकारिक API, इमेज और फ़ाइल समर्थन के साथ, API कुंजी की आवश्यकता है

source: Mistral
hi: मिस्ट्रल

source: Mistral API
hi: मिस्ट्रल API

source: OpenRouter
hi: ओपनराउटर

source: Openrouter.ai API, supports lots of models
hi: Openrouter.ai API, बहुत सारे मॉडल का समर्थन करता है

source: Deepseek
hi: डीपसीक

source: Deepseek API, strongest open source models
hi: डीपसीक API, सबसे शक्तिशाली ओपन सोर्स मॉडल

source: Custom Command
hi: कस्टम कमांड

source: Use the output of a custom command
hi: एक कस्टम कमांड के आउटपुट का उपयोग करें

source: CMU Sphinx
hi: CMU स्फिंक्स

source: Works offline. Only English supported
hi: ऑफ़लाइन काम करता है। केवल अंग्रेज़ी समर्थित

source: Whisper C++
hi: व्हिस्पर C++

source: Works offline. Optimized Whisper impelementation written in C++
hi: ऑफ़लाइन काम करता है। C++ में लिखा गया अनुकूलित व्हिस्पर कार्यान्वयन

source: Google Speech Recognition
hi: गूगल स्पीच रिकग्निशन

source: Google Speech Recognition online
hi: गूगल स्पीच रिकग्निशन ऑनलाइन

source: Groq Speech Recognition
hi: Groq स्पीच रिकग्निशन

source: wit.ai speech recognition free API (language chosen on the website)
hi: wit.ai स्पीच रिकग्निशन मुफ्त API (भाषा वेबसाइट पर चुनी गई)

source: Works Offline
hi: ऑफ़लाइन काम करता है

source: Whisper API
hi: व्हिस्पर API

source: Uses OpenAI Whisper API
hi: OpenAI व्हिस्पर API का उपयोग करता है

source: Custom command
hi: कस्टम कमांड

source: Runs a custom command
hi: एक कस्टम कमांड चलाता है

source: Google TTS
hi: गूगल TTS

source: Google's text to speech
hi: गूगल का टेक्स्ट-टू-स्पीच

source: Kokoro TTS
hi: कोकोरो TTS

source: Lightweight and fast open source TTS engine. ~3GB dependencies, 400MB model
hi: हल्का और तेज़ ओपन सोर्स TTS इंजन। ~3GB निर्भरताएँ, 400MB मॉडल

source: ElevenLabs TTS
hi: इलेवनलैब्स TTS

source: Natural sounding TTS
hi: प्राकृतिक लगने वाला TTS

source: Custom OpenAI TTS
hi: कस्टम OpenAI TTS

source: Espeak TTS
hi: ईस्पीक TTS

source: Offline TTS
hi: ऑफ़लाइन TTS

source: Use a custom command as TTS, {0} will be replaced with the text
hi: TTS के रूप में एक कस्टम कमांड का उपयोग करें, {0} को टेक्स्ट से बदल दिया जाएगा

source: WordLlama
hi: वर्डलामा

source: Light local embedding model based on llama. Works offline, very low resources usage
hi: लामा पर आधारित हल्का स्थानीय एम्बेडिंग मॉडल। ऑफ़लाइन काम करता है, बहुत कम संसाधन उपयोग

source: Ollama Embedding
hi: Ollama एम्बेडिंग

source: Use Ollama models for Embedding. Works offline, very low resources usage
hi: एम्बेडिंग के लिए Ollama मॉडल का उपयोग करें। ऑफ़लाइन काम करता है, बहुत कम संसाधन उपयोग

source: Use Google Gemini API to get embeddings
hi: एम्बेडिंग प्राप्त करने के लिए गूगल जेमिनी API का उपयोग करें

source: User Summary
hi: उपयोगकर्ता सारांश

source: Generate a summary of the user's conversation
hi: उपयोगकर्ता की बातचीत का सारांश उत्पन्न करें

source: Memoripy
hi: मेमोरीपाई

source: Extract messages from previous conversations using contextual memory retrivial, memory decay, concept extraction and other advanced techniques. Does 1 llm call per message.
hi: प्रासंगिक मेमोरी रिट्रीवल, मेमोरी डेके, अवधारणा निष्कर्षण और अन्य उन्नत तकनीकों का उपयोग करके पिछली बातचीत से संदेश निकालें। प्रति संदेश 1 एलएलएम कॉल करता है।

source: User Summary + Memoripy
hi: उपयोगकर्ता सारांश + मेमोरीपाई

source: Use both technologies for long term memory
hi: दीर्घकालिक मेमोरी के लिए दोनों तकनीकों का उपयोग करें

source: Document reader
hi: दस्तावेज़ रीडर

source: Classic RAG approach - chunk documents and embed them, then compare them to the query and return the most relevant documents
hi: क्लासिक RAG दृष्टिकोण - दस्तावेज़ों को खंडित करें और उन्हें एम्बेड करें, फिर उनकी क्वेरी से तुलना करें और सबसे प्रासंगिक दस्तावेज़ लौटाएं

source: SearXNG - Private and selfhostable search engine
hi: SearXNG - निजी और स्व-होस्ट करने योग्य सर्च इंजन

source: DuckDuckGo
hi: डकडकगो

source: DuckDuckGo search
hi: डकडकगो खोज

source: Tavily
hi: टैविली

source: Tavily search
hi: टैविली खोज

source: Helpful assistant
hi: सहायक असिस्टेंट

source: General purpose prompt to enhance the LLM answers and give more context
hi: LLM उत्तरों को बढ़ाने और अधिक संदर्भ देने के लिए सामान्य प्रयोजन प्रॉम्प्ट

source: Console access
de: Konsolenzugriff
hi: कंसोल एक्सेस
ru: Доступ к консоли

source: Can the program run terminal commands on the computer
de: Kann das Programm Terminalbefehle auf dem Computer ausführen
hi: क्या प्रोग्राम कंप्यूटर पर टर्मिनल कमांड चला सकता है
ru: Может ли программа выполнять команды терминала на компьютере

source: Current directory
hi: वर्तमान डायरेक्टरी

source: What is the current directory
hi: वर्तमान डायरेक्टरी क्या है

source: Allow the LLM to search on the internet
hi: LLM को इंटरनेट पर खोजने की अनुमति दें

source: Basic functionality
de: Grundlegende Funktionalität
hi: बुनियादी कार्यक्षमता
ru: Основные функции

source: Showing tables and code (*can work without it)
de: Tabellen und Code anzeigen (*kann auch ohne funktionieren)
hi: तालिकाएँ और कोड दिखाना (*इसके बिना काम कर सकता है)
ru: Показывать таблицы и код (*может работать без этого)

source: Graphs access
de: Zugriff auf Diagramme
hi: ग्राफ़ एक्सेस
ru: Доступ к графикам

source: Can the program display graphs
de: Kann das Programm Diagramme anzeigen
hi: क्या प्रोग्राम ग्राफ़ प्रदर्शित कर सकता है
ru: Может ли программа отображать графики

source: Show image
de: Bild anzeigen
hi: छवि दिखाएं
ru: Показать изображение

source: Show image in chat
de: Bild im Chat anzeigen
hi: चैट में छवि दिखाएं
ru: Показывать изображение в чате

source: Custom Prompt
hi: कस्टम प्रॉम्प्ट

source: Add your own custom prompt
hi: अपना स्वयं का कस्टम प्रॉम्प्ट जोड़ें

source: Memory
hi: मेमोरी

source: Interface settings, hidden files, reverse order, zoom...
hi: इंटरफ़ेस सेटिंग्स, छिपी हुई फ़ाइलें, उलटा क्रम, ज़ूम...

source: General settings, virtualization, offers, memory length, automatically generate chat name, current folder...
hi: सामान्य सेटिंग्स, वर्चुअलाइज़ेशन, ऑफ़र, मेमोरी की लंबाई, चैट नाम स्वचालित रूप से जनरेट करें, वर्तमान फ़ोल्डर...

source: Prompts settings, custom extra prompt, custom prompts...
hi: प्रॉम्प्ट सेटिंग्स, कस्टम अतिरिक्त प्रॉम्प्ट, कस्टम प्रॉम्प्ट...

source: Keyboard shorcuts
hi: कीबोर्ड शॉर्टकट

source: About
de: Über
hi: बारे में
ru: О программе

source: Chat
hi: चैट
ru: Чат

source: History
de: Verlauf
hi: इतिहास
ru: История

source: Create a chat
de: Einen Chat erstellen
hi: एक चैट बनाएं
ru: Создать чат

source: Stop
de: Stopp
hi: रोकें
ru: Остановить

source: Clear
de: Löschen
hi: साफ़ करें
ru: Очистить

source: Continue
de: Fortsetzen
hi: जारी रखें
ru: Продолжить

source: Regenerate
de: Neu generieren
hi: फिर से उत्पन्न करें
ru: Перегенерировать

source: Send a message...
hi: एक संदेश भेजें...

source: Ask about a website
hi: एक वेबसाइट के बारे में पूछें

source: Write #https://website.com in chat to ask information about a website
hi: किसी वेबसाइट के बारे में जानकारी पूछने के लिए चैट में #https://website.com लिखें

source: We have a lot of extensions for different things. Check it out!
hi: हमारे पास विभिन्न चीज़ों के लिए बहुत सारे एक्सटेंशन हैं। उन्हें देखें!

source: Add your documents to your documents folder and chat using the information contained in them!
hi: अपने दस्तावेज़ों को अपने दस्तावेज़ फ़ोल्डर में जोड़ें और उनमें निहित जानकारी का उपयोग करके चैट करें!

source: Surf the web!
hi: वेब सर्फ करें!

source: Enable web search to allow the LLM to surf the web and provide up to date answers
hi: LLM को वेब सर्फ करने और अद्यतित उत्तर प्रदान करने की अनुमति देने के लिए वेब खोज सक्षम करें

source: Mini Window
hi: मिनी विंडो

source: Ask questions on the fly using the mini window mode
hi: मिनी विंडो मोड का उपयोग करके तुरंत प्रश्न पूछें

source: Newelle supports text-to-speech! Enable it in the settings
hi: न्यूएले टेक्स्ट-टू-स्पीच का समर्थन करता है! इसे सेटिंग्स में सक्षम करें

source: Newelle gives you 100% prompt control. Tune your prompts for your use.
hi: न्यूएले आपको 100% प्रॉम्प्ट नियंत्रण देता है। अपनी उपयोग के लिए अपने प्रॉम्प्ट को ट्यून करें।

source: Check the programs and processes you run from Newelle
hi: न्यूएले से आपके द्वारा चलाए जा रहे प्रोग्राम और प्रक्रियाओं की जाँच करें

source: Provider Errror
hi: प्रदाता त्रुटि

source: This provider does not have a model list
hi: इस प्रदाता के पास मॉडल सूची नहीं है

source: Models
hi: मॉडल

source: Search Models...
hi: मॉडल खोजें...

source: Create new profile
hi: नया प्रोफ़ाइल बनाएं

source: Could not recognize your voice
hi: आपकी आवाज़ पहचानी नहीं जा सकी

source: Images
hi: छवियाँ

source: LLM Supported Files
hi: LLM समर्थित फ़ाइलें

source: RAG Supported files
hi: RAG समर्थित फ़ाइलें

source: Supported Files
hi: समर्थित फ़ाइलें

source: All Files
hi: सभी फ़ाइलें

source: Attach file
hi: फ़ाइल संलग्न करें

source: File not found
de: Datei nicht gefunden
hi: फ़ाइल नहीं मिली
ru: Файл не найден

source: The file cannot be sent until the program is finished
de: Die Datei kann erst gesendet werden, wenn das Programm beendet ist
hi: प्रोग्राम समाप्त होने तक फ़ाइल नहीं भेजी जा सकती
ru: Файл не может быть отправлен, пока программа не завершится

source: The file is not recognized
de: Die Datei wird nicht erkannt
hi: फ़ाइल पहचानी नहीं गई है
ru: Файл не распознан

source: Folder is Empty
de: Der Ordner ist leer
hi: फ़ोल्डर खाली है
ru: Папка пуста

source: You can no longer continue the message.
de: Sie können die Nachricht nicht mehr fortsetzen.
hi: आप अब संदेश जारी नहीं रख सकते।
ru: Вы больше не можете продолжить сообщение.

source: You can no longer regenerate the message.
de: Sie können die Nachricht nicht mehr neu generieren.
hi: आप अब संदेश को फिर से उत्पन्न नहीं कर सकते।
ru: Вы больше не можете перегенерировать сообщение.

source: Chat is empty
de: Der Chat ist leer
hi: चैट खाली है
ru: Чат пуст

source: Chat is cleared
de: Chat wurde gelöscht
hi: चैट साफ़ हो गया है
ru: Чат очищен

source: The message was canceled and deleted from history
de: Die Nachricht wurde abgebrochen und aus dem Verlauf gelöscht
hi: संदेश रद्द कर दिया गया और इतिहास से हटा दिया गया
ru: Сообщение было отменено и удалено из истории

source: The message cannot be sent until the program is finished
de: Die Nachricht kann erst gesendet werden, wenn das Programm beendet ist
hi: प्रोग्राम समाप्त होने तक संदेश नहीं भेजा जा सकता
ru: Сообщение не может быть отправлено, пока программа не завершится

source: You can't edit a message while the program is running.
de: Sie können keine Nachricht bearbeiten, während das Programm läuft.
hi: प्रोग्राम चलते समय आप संदेश संपादित नहीं कर सकते।
ru: Нельзя редактировать сообщение во время работы программы.

source: Prompt content
hi: प्रॉम्प्ट सामग्री

source: The neural network has access to your computer and any data in this chat and can run commands, be careful, we are not responsible for the neural network. Do not share any sensitive information.
hi: न्यूरल नेटवर्क के पास आपके कंप्यूटर और इस चैट के किसी भी डेटा तक पहुंच है और यह कमांड चला सकता है, सावधान रहें, हम न्यूरल नेटवर्क के लिए जिम्मेदार नहीं हैं। कोई भी संवेदनशील जानकारी साझा न करें।

source: The neural network has access to any data in this chat, be careful, we are not responsible for the neural network. Do not share any sensitive information.
hi: न्यूरल नेटवर्क के पास इस चैट में किसी भी डेटा तक पहुंच है, सावधान रहें, हम न्यूरल नेटवर्क के लिए जिम्मेदार नहीं हैं। कोई भी संवेदनशील जानकारी साझा न करें।

source: Wrong folder path
de: Falscher Ordnerpfad
hi: गलत फ़ोल्डर पथ
ru: Неверный путь к папке

source: Thread has not been completed, thread number:
de: Thread wurde nicht abgeschlossen, Thread-Nummer:
hi: थ्रेड पूरा नहीं हुआ है, थ्रेड संख्या:
ru: Поток не завершен, номер потока:

source: Failed to open the folder
de: Fehler beim Öffnen des Ordners
hi: फ़ोल्डर खोलने में विफल
ru: Не удалось открыть папку

source: Terminal threads are still running in the background
de: Terminal-Threads laufen noch im Hintergrund
hi: टर्मिनल थ्रेड अभी भी पृष्ठभूमि में चल रहे हैं
ru: Потоки терминала все еще работают в фоновом режиме

source: When you close the window, they will be automatically terminated
de: Wenn Sie das Fenster schließen, werden sie automatisch beendet
hi: जब आप विंडो बंद करते हैं, तो वे स्वचालित रूप से समाप्त हो जाएंगे
ru: При закрытии окна они будут автоматически завершены

source: Cancel
de: Abbrechen
hi: रद्द करें
ru: Отмена

source: Close
de: Schließen
hi: बंद करें
ru: Закрыть

source: Chat is rebooted
de: Chat wird neu gestartet
hi: चैट रीबूट हो गया है
ru: Чат перезапущен

source: Folder is rebooted
de: Ordner wird neu gestartet
hi: फ़ोल्डर रीबूट हो गया है
ru: Папка перезагружена

source: Chat is created
de: Chat wurde erstellt
hi: चैट बन गया है
ru: Чат создан

source: Newelle: Your advanced chat bot
hi: न्यूएले: आपका उन्नत चैट बॉट

source: chat;ai;gpt;chatgpt;assistant;
hi: चैट;एआई;जीपीटी;चैटजीपीटी;सहायक;

source: Train Newelle to do more with custom extensions and new AI modules, giving your chatbot endless possibilities.
hi: कस्टम एक्सटेंशन और नए एआई मॉड्यूल के साथ न्यूएले को अधिक काम करने के लिए प्रशिक्षित करें, जिससे आपके चैटबॉट को अनंत संभावनाएँ मिलें।

source: AI chatbot
hi: एआई चैटबॉट

source: Quick profile selection
hi: त्वरित प्रोफ़ाइल चयन

source: More than 10 standard AI providers
hi: 10 से अधिक मानक एआई प्रदाता

source: Added new features
hi: नई सुविधाएँ जोड़ी गईं

source: Bug fixes
hi: बग फिक्स

source: Website reading and web search with SearXNG, DuckDuckGo, and Tavily
hi: SearXNG, DuckDuckGo, और Tavily के साथ वेबसाइट पढ़ना और वेब खोज

source: Improved LaTeX rendering and document management
hi: बेहतर LaTeX रेंडरिंग और दस्तावेज़ प्रबंधन

source: New Thinking Widget and OpenRouter handler
hi: नया थिंकिंग विजेट और OpenRouter हैंडलर

source: Vision support for Llama4 on Groq
hi: Groq पर Llama4 के लिए विज़न सपोर्ट

source: New translations (Traditional Chinese, Bengali, Hindi)
hi: नए अनुवाद (पारंपरिक चीनी, बंगाली, हिंदी)

source: Fixed many bugs, added some features!
hi: कई बग फिक्स किए गए, कुछ सुविधाएँ जोड़ी गईं!

source: Support for new features and bug fixes
hi: नई सुविधाओं और बग फिक्स के लिए समर्थन

source: Added many new features and bug fixes
hi: कई नई सुविधाएँ और बग फिक्स जोड़े गए

source: Added new features and bug fixes
hi: नई सुविधाएँ और बग फिक्स जोड़े गए

source: Updated the g4f library with versioning, added user guides, improved extension browsing, and enhanced model handling.
hi: g4f लाइब्रेरी को वर्ज़निंग के साथ अपडेट किया गया, उपयोगकर्ता गाइड जोड़े गए, एक्सटेंशन ब्राउज़िंग में सुधार किया गया, और मॉडल हैंडलिंग को बढ़ाया गया।

source: Bug fixes and new features have been implemented. We've modified the extension architecture, added new models, and introduced vision support, along with more capabilities.
hi: बग फिक्स और नई सुविधाएँ लागू की गई हैं। हमने एक्सटेंशन आर्किटेक्चर को संशोधित किया है, नए मॉडल जोड़े हैं, और दृष्टि समर्थन के साथ-साथ अधिक क्षमताएँ भी पेश की हैं।

source: Stable version
hi: स्थिर संस्करण

source: Localization
hi: स्थानीयकरण

source: Redesign
hi: पुनर्निमाण

source: Qwersyk
hi: क्वेर्सीक

source: Choose an extension
de: Wählen Sie eine Erweiterung
ru: Выберите расширение

source: has been removed
de: wurde entfernt
ru: удалено

source: Add extension
de: Erweiterung hinzufügen
ru: Добавить расширение

source: Extension added. New extensions will run from the next launch
de: Erweiterung hinzugefügt. Neue Erweiterungen werden ab dem nächsten Start ausgeführt
ru: Расширение добавлено. Новые расширения будут запущены с следующего запуска

source: The extension is wrong
de: Die Erweiterung ist falsch
ru: Неверное расширение

source: This is not an extension
de: Dies ist keine Erweiterung
ru: Это не расширение

source: Keyboard shortcuts
de: Tastenkürzel
ru: Горячие клавиши

source: Failed to send bot a message
de: Senden der Nachricht an den Bot fehlgeschlagen
ru: Не удалось отправить сообщение боту

source: Chat has been stopped
de: Der Chat wurde gestoppt
ru: Чат был остановлен

source: Attention the neural network has access to your computer, be careful, we are not responsible for the neural network.
de: Achtung: Das neuronale Netzwerk hat Zugriff auf Ihren Computer.Seien Sie vorsichtig, wir übernehmen keine Verantwortung für das neuronale Netzwerk.
ru: Внимание! Нейронная сеть имеет доступ к вашему компьютеру.Будьте осторожны, мы не несем ответственности за нейронную сеть.

source: The change will take effect after you restart the program.
de: Die Änderung wird erst nach dem Neustart des Programms wirksam.
ru: Изменения вступят в силу после перезапуска программы.
