Repository: qwersyk/Newelle
Catalog: po/*.po
Languages: de, hi, ru

source: Select profile
hi: प्रोफ़ाइल चुनें

source: Thoughts
hi: विचार

source: Expand to see details
hi: विवरण देखने के लिए विस्तार करें

source: Thinking...
hi: सोच रहा है...

source: The LLM is thinking... Expand to see thought process
hi: एलएलएम सोच रहा है... विचार प्रक्रिया देखने के लिए विस्तार करें

source: No thought process recorded
hi: कोई विचार प्रक्रिया दर्ज नहीं की गई है

source: Extensions
de: Erweiterungen
hi: एक्सटेंशन
ru: Расширения

source: User guide to Extensions
hi: एक्सटेंशन के लिए उपयोगकर्ता मार्गदर्शिका

source: Download new Extensions
hi: नए एक्सटेंशन डाउनलोड करें

source: Install extension from file...
hi: फ़ाइल से एक्सटेंशन स्थापित करें...

source: Thread editing
de: Thread-Bearbeitung
hi: थ्रेड संपादन
ru: Редактирование потока

source: No threads are running
de: Es laufen keine Threads
hi: कोई थ्रेड नहीं चल रहा है
ru: Нет работающих потоков

source: Thread number:
de: Thread-Nummer:
hi: थ्रेड संख्या:
ru: Номер потока:

source: Settings
de: Einstellungen
hi: सेटिंग्स
ru: Настройки

source: The settings of the current profile will be copied into the new one
hi: वर्तमान प्रोफ़ाइल की सेटिंग्स को नए में कॉपी किया जाएगा

source: Set profile picture
hi: प्रोफ़ाइल चित्र सेट करें

source: General
hi: सामान्य

source: Prompts
hi: प्रॉम्प्ट

source: Knowledge
hi: ज्ञान

source: Language Model
hi: भाषा मॉडल

source: Other LLMs
hi: अन्य LLMs

source: Other available LLM providers
hi: अन्य उपलब्ध LLM प्रदाता

source: Advanced LLM Settings
hi: उन्नत LLM सेटिंग्स

source: Secondary Language Model
hi: द्वितीयक भाषा मॉडल

source: Model used for secondary tasks, like offer, chat name and memory generation
hi: ऑफ़र, चैट नाम और मेमोरी जनरेशन जैसे द्वितीयक कार्यों के लिए उपयोग किया जाने वाला मॉडल

source: Embedding Model
hi: एम्बेडिंग मॉडल

source: Embedding is used to trasform text into vectors. Used by Long Term Memory and RAG. Changing it might require you to re-index documents or reset memory.
hi: एम्बेडिंग का उपयोग टेक्स्ट को वेक्टर में बदलने के लिए किया जाता है। दीर्घकालिक मेमोरी और RAG द्वारा उपयोग किया जाता है। इसे बदलने पर आपको दस्तावेज़ों को फिर से इंडेक्स करने या मेमोरी रीसेट करने की आवश्यकता हो सकती है।

source: Long Term Memory
hi: दीर्घकालिक मेमोरी

source: Keep memory of old conversations
hi: पुरानी बातचीत की मेमोरी रखें

source: Web Search
hi: वेब खोज

source: Search information on the Web
hi: वेब पर जानकारी खोजें

source: Voice
hi: आवाज़

source: Text To Speech Program
hi: टेक्स्ट टू स्पीच प्रोग्राम

source: Choose which text to speech to use
hi: चुनें कि किस टेक्स्ट टू स्पीच का उपयोग करना है

source: Speech To Text Engine
hi: स्पीच टू टेक्स्ट इंजन

source: Choose which speech recognition engine you want
hi: चुनें कि आप कौन सा स्पीच रिकग्निशन इंजन चाहते हैं

source: Automatic Speech To Text
hi: स्वचालित स्पीच टू टेक्स्ट

source: Automatically restart speech to text at the end of a text/TTS
hi: टेक्स्ट/TTS के अंत में स्वचालित रूप से स्पीच टू टेक्स्ट पुनरारंभ करें

source: Prompt control
de: Prompt-Steuerung
hi: प्रॉम्प्ट नियंत्रण
ru: Управление подсказками

source: Interface
de: Benutzeroberfläche
hi: इंटरफ़ेस
ru: Интерфейс

source: Interface Size
hi: इंटरफ़ेस आकार

source: Adjust the size of the interface
hi: इंटरफ़ेस के आकार को समायोजित करें

source: Hidden files
de: Versteckte Dateien
hi: छिपी हुई फ़ाइलें
ru: Скрытые файлы

source: Show hidden files
de: Versteckte Dateien anzeigen
hi: छिपी हुई फ़ाइलें दिखाएं
ru: Показать скрытые файлы

source: Send with ENTER
hi: ENTER के साथ भेजें

source: If enabled, messages will be sent with ENTER, to go to a new line use CTRL+ENTER. If disabled, messages will be sent with SHIFT+ENTER, and newline with enter
hi: यदि सक्षम है, तो संदेश ENTER के साथ भेजे जाएंगे, नई पंक्ति पर जाने के लिए CTRL+ENTER का उपयोग करें। यदि अक्षम है, तो संदेश SHIFT+ENTER के साथ भेजे जाएंगे, और ENTER के साथ नई पंक्ति।

source: Remove thinking from history
hi: इतिहास से सोच हटा दें

source: Do not send old thinking blocks for reasoning models in order to reduce token usage
hi: टोकन उपयोग को कम करने के लिए तर्क मॉडल के लिए पुराने सोच ब्लॉक न भेजें

source: Display LaTeX
hi: LaTeX प्रदर्शित करें

source: Display LaTeX formulas in chat
hi: चैट में LaTeX सूत्र प्रदर्शित करें

source: Reverse Chat Order
hi: चैट क्रम उलटें

source: Show most recent chats on top in chat list (change chat to apply)
hi: चैट सूची में सबसे हालिया चैट शीर्ष पर दिखाएं (लागू करने के लिए चैट बदलें)

source: Automatically Generate Chat Names
hi: स्वचालित रूप से चैट नाम उत्पन्न करें

source: Generate chat names automatically after the first two messages
hi: पहले दो संदेशों के बाद स्वचालित रूप से चैट नाम उत्पन्न करें

source: Number of offers
de: Anzahl der Angebote
hi: ऑफ़र की संख्या
ru: Количество предложений

source: Number of message suggestions to send to chat
de: Anzahl der Nachrichtenvorschläge, die an den Chat gesendet werden sollen
hi: चैट पर भेजने के लिए संदेश सुझावों की संख्या
ru: Количество предложений сообщений для отправки в чат

source: Username
hi: उपयोगकर्ता नाम

source: Change the label that appears before your message This information is not sent to the LLM by default You can add it to a prompt using the {USER} variable
hi: आपके संदेश से पहले दिखाई देने वाला लेबल बदलें यह जानकारी डिफ़ॉल्ट रूप से LLM को नहीं भेजी जाती है आप इसे {USER} वेरिएबल का उपयोग करके प्रॉम्प्ट में जोड़ सकते हैं

source: Neural Network Control
de: Steuerung des neuronalen Netzwerks
hi: न्यूरल नेटवर्क नियंत्रण
ru: Управление нейронной сетью

source: Command virtualization
de: Befehlsvirtualisierung
hi: कमांड वर्चुअलाइजेशन
ru: Виртуализация команд

source: Run commands in a virtual machine
de: Befehle in einer virtuellen Maschine ausführen
hi: वर्चुअल मशीन में कमांड चलाएं
ru: Выполнять команды в виртуальной машине

source: External Terminal
hi: बाहरी टर्मिनल

source: Choose the external terminal where to run the console commands
hi: वह बाहरी टर्मिनल चुनें जहां कंसोल कमांड चलाना है

source: Program memory
de: Programmspeicher
hi: प्रोग्राम मेमोरी
ru: Память программы

source: How long the program remembers the chat
de: Wie lange das Programm sich an den Chat erinnert
hi: प्रोग्राम चैट को कितनी देर तक याद रखता है
ru: Сколько времени программа запоминает чат

source: Auto-run commands
de: Befehle automatisch ausführen
hi: स्वतः-रन कमांड
ru: Автоматическое выполнение команд

source: Commands that the bot will write will automatically run
de: Befehle, die der Bot schreibt, werden automatisch ausgeführt
hi: बॉट द्वारा लिखे जाने वाले कमांड स्वचालित रूप से चलेंगे
ru: Команды, которые будет написывать бот, будут выполняться автоматически

source: Max number of commands
hi: कमांड की अधिकतम संख्या

source: Maximum number of commands that the bot will write after a single user request
hi: एकल उपयोगकर्ता अनुरोध के बाद बॉट द्वारा लिखे जाने वाले कमांड की अधिकतम संख्या

source: Document Sources (RAG)
hi: दस्तावेज़ स्रोत (RAG)

source: Include content from your documents in the responses
hi: प्रतिक्रियाओं में अपने दस्तावेज़ों से सामग्री शामिल करें

source: Document Analyzer
hi: दस्तावेज़ विश्लेषक

source: The document analyzer uses multiple techniques to extract relevant information about your documents
hi: दस्तावेज़ विश्लेषक आपके दस्तावेज़ों के बारे में प्रासंगिक जानकारी निकालने के लिए कई तकनीकों का उपयोग करता है

source: Read documents if unsupported
hi: यदि असमर्थित हो तो दस्तावेज़ पढ़ें

source: If the LLM does not support reading documents, relevant information about documents sent in the chat will be given to the LLM using your Document Analyzer.
hi: यदि LLM दस्तावेज़ पढ़ने का समर्थन नहीं करता है, तो चैट में भेजे गए दस्तावेज़ों के बारे में प्रासंगिक जानकारी आपके दस्तावेज़ विश्लेषक का उपयोग करके LLM को दी जाएगी।

source: Maximum tokens for RAG
hi: RAG के लिए अधिकतम टोकन

source: The maximum amount of tokens to be used for RAG. If the documents do not exceed this token count, dump all of them in the context
hi: RAG के लिए उपयोग किए जाने वाले टोकन की अधिकतम मात्रा। यदि दस्तावेज़ इस टोकन संख्या से अधिक नहीं हैं, तो उन सभी को संदर्भ में डंप करें।

source: Document Folder
hi: दस्तावेज़ फ़ोल्डर

source: Put the documents you want to query in your document folder. The document analyzer will find relevant information in them if this option is enabled
hi: जिन दस्तावेज़ों से आप क्वेरी करना चाहते हैं उन्हें अपने दस्तावेज़ फ़ोल्डर में डालें। यदि यह विकल्प सक्षम है तो दस्तावेज़ विश्लेषक उनमें प्रासंगिक जानकारी ढूंढेगा

source: Put all the documents you want to index in this folder
hi: उन सभी दस्तावेज़ों को जिन्हें आप इंडेक्स करना चाहते हैं, इस फ़ोल्डर में डालें

source: Silence threshold
hi: मौन सीमा

source: Silence threshold in seconds, percentage of the volume to be considered silence
hi: सेकंड में मौन सीमा, मौन माने जाने वाले वॉल्यूम का प्रतिशत

source: Silence time
hi: मौन समय

source: Silence time in seconds before recording stops automatically
hi: रिकॉर्डिंग स्वचालित रूप से बंद होने से पहले सेकंड में मौन समय

source: Not enough permissions
hi: पर्याप्त अनुमतियाँ नहीं

source: Newelle does not have enough permissions to run commands on your system, please run the following command
hi: न्युएल के पास आपके सिस्टम पर कमांड चलाने के लिए पर्याप्त अनुमतियाँ नहीं हैं, कृपया निम्न कमांड चलाएँ

source: Understood
hi: समझ गया

source: Help
de: Hilfe
hi: मदद
ru: Помощь

source: Shortcuts
de: Tastenkombinationen
hi: शॉर्टकट
ru: Горячие клавиши

source: Reload chat
de: Chat neu laden
hi: चैट रीलोड करें
ru: Перезагрузить чат

source: Reload folder
de: Ordner neu laden
hi: फ़ोल्डर रीलोड करें
ru: Перезагрузить папку

source: New tab
de: Neuer Tab
hi: नया टैब
ru: Новая вкладка

source: Paste Image
hi: छवि पेस्ट करें

source: Focus message box
hi: संदेश बॉक्स फोकस करें

source: Start recording
hi: रिकॉर्डिंग शुरू करें

source: Stop TTS
hi: TTS रोकें

source: Zoom in
hi: ज़ूम इन करें

source: Zoom out
hi: ज़ूम आउट करें

source: Welcome to Newelle
hi: न्युएल में आपका स्वागत है

source: Your ultimate virtual assistant.
hi: आपका परम वर्चुअल असिस्टेंट।

source: Github Page
hi: गिटहब पेज

source: Choose your favourite AI Language Model
hi: अपना पसंदीदा AI भाषा मॉडल चुनें

source: Newelle can be used with mutiple models and providers! <b>Note: It is strongly suggested to read the Guide to LLM page</b>
hi: न्युएल का उपयोग कई मॉडलों और प्रदाताओं के साथ किया जा सकता है! <b>ध्यान दें: LLM के लिए गाइड पेज पढ़ने का पुरजोर सुझाव दिया जाता है</b>

source: Guide to LLM
hi: LLM के लिए गाइड

source: Chat with your documents
hi: अपने दस्तावेज़ों के साथ चैट करें

source: Newelle can retrieve relevant information from documents you send in the chat or from your own files! Information relevant to your query will be sent to the LLM.
hi: न्युएल चैट में आपके द्वारा भेजे गए दस्तावेज़ों से या आपकी अपनी फ़ाइलों से प्रासंगिक जानकारी प्राप्त कर सकता है! आपकी क्वेरी से संबंधित जानकारी LLM को भेजी जाएगी।

source: Newelle can be used to run commands on your system, but pay attention at what you run! <b>The LLM is not under our control, so it might generate malicious code!</b> By default, your commands will be <b>virtualized in the Flatpak environment</b>, but pay attention!
hi: न्युएल का उपयोग आपके सिस्टम पर कमांड चलाने के लिए किया जा सकता है, लेकिन ध्यान दें कि आप क्या चलाते हैं! <b>LLM हमारे नियंत्रण में नहीं है, इसलिए यह दुर्भावनापूर्ण कोड उत्पन्न कर सकता है!</b> डिफ़ॉल्ट रूप से, आपके कमांड <b>फ्लैटपैक वातावरण में वर्चुअलाइज्ड</b> होंगे, लेकिन ध्यान दें!

source: You can extend Newelle's functionalities using extensions!
hi: आप एक्सटेंशन का उपयोग करके न्युएल की कार्यात्मकताओं का विस्तार कर सकते हैं!

source: Download extensions
hi: एक्सटेंशन डाउनलोड करें

source: Permission Error
hi: अनुमति त्रुटि

source: Newelle does not have enough permissions to run commands on your system.
hi: न्युएल के पास आपके सिस्टम पर कमांड चलाने के लिए पर्याप्त अनुमतियाँ नहीं हैं।

source: Begin using the app
hi: ऐप का उपयोग शुरू करें

source: Start chatting
hi: चैटिंग शुरू करें

source: Newelle
hi: न्युएल

source: Chat is opened in mini window
hi: चैट मिनी विंडो में खोला गया है

source: Message Streaming
hi: संदेश स्ट्रीमिंग

source: Gradually stream message output
hi: धीरे-धीरे संदेश आउटपुट स्ट्रीम करें

source: Chat
hi: चैट
ru: Чат

source: Command to execute
hi: निष्पादित करने के लिए कमांड

source: {0} will be replaced with the model fullpath
hi: {0} को मॉडल के पूर्ण पथ से बदल दिया जाएगा

source: Endpoint
hi: एंडपॉइंट

source: Custom endpoint of the service to use
hi: उपयोग करने के लिए सेवा का कस्टम एंडपॉइंट

source: API Key
hi: API कुंजी

source: The API key to use
hi: उपयोग करने के लिए API कुंजी

source: The voice to use
hi: उपयोग करने के लिए आवाज़

source: Model
hi: मॉडल

source: The model to use
hi: उपयोग करने के लिए मॉडल

source: Instructions
hi: निर्देश

source: Instructions for the voice generation. Leave it blank to avoid this field
hi: आवाज़ पीढ़ी के लिए निर्देश। इस फ़ील्ड से बचने के लिए इसे खाली छोड़ दें

source: Choose the preferred voice
hi: पसंदीदा आवाज़ चुनें

source: API Key for ElevenLabs
hi: इलेवनलैब्स के लिए API कुंजी

source: Voice ID to use
hi: उपयोग करने के लिए आवाज़ आईडी

source: Name of the model to use
hi: उपयोग करने के लिए मॉडल का नाम

source: Stability
hi: स्थिरता

source: stability of the voice
hi: आवाज़ की स्थिरता

source: Similarity boost
hi: समानता बूस्ट

source: Boosts overall voice clarity and speaker similarity
hi: समग्र आवाज़ स्पष्टता और स्पीकर समानता को बढ़ाता है

source: Style exaggeration
hi: शैली अतिशयोक्ति

source: High values are reccomended if the style of the speech must be exaggerated
hi: यदि भाषण की शैली को अतिरंजित किया जाना चाहिए तो उच्च मानों की सिफारिश की जाती है

source: Command to execute to get bot output
hi: बॉट आउटपुट प्राप्त करने के लिए निष्पादित करने हेतु कमांड

source: Command to execute to get bot response, {0} will be replaced with a JSON file containing the chat, {1} with the system prompt
hi: बॉट प्रतिक्रिया प्राप्त करने के लिए निष्पादित करने हेतु कमांड, {0} को चैट वाली JSON फ़ाइल से, {1} को सिस्टम प्रॉम्प्ट से बदल दिया जाएगा

source: Command to execute to get bot's suggestions
hi: बॉट के सुझाव प्राप्त करने के लिए निष्पादित करने हेतु कमांड

source: Command to execute to get chat suggestions, {0} will be replaced with a JSON file containing the chat, {1} with the extra prompts, {2} with the numer of suggestions to generate. Must return a JSON array containing the suggestions as strings
hi: चैट सुझाव प्राप्त करने के लिए निष्पादित करने हेतु कमांड, {0} को चैट वाली JSON फ़ाइल से, {1} को अतिरिक्त प्रॉम्प्ट से, {2} को उत्पन्न करने के लिए सुझावों की संख्या से बदल दिया जाएगा। स्ट्रिंग्स के रूप में सुझावों वाली JSON सरणी लौटानी होगी

source: API Key (required)
hi: API कुंजी (आवश्यक)

source: API key got from ai.google.dev
hi: ai.google.dev से प्राप्त API कुंजी

source: AI Model to use
hi: उपयोग करने के लिए AI मॉडल

source: Enable System Prompt
hi: सिस्टम प्रॉम्प्ट सक्षम करें

source: Some models don't support system prompt (or developers instructions), disable it if you get errors about it
hi: कुछ मॉडल सिस्टम प्रॉम्प्ट (या डेवलपर निर्देश) का समर्थन नहीं करते हैं, यदि आपको इसके बारे में त्रुटियां मिलती हैं तो इसे अक्षम करें

source: Inject system prompt
hi: सिस्टम प्रॉम्प्ट इंजेक्ट करें

source: Even if the model doesn't support system prompts, put the prompts on top of the user message
hi: भले ही मॉडल सिस्टम प्रॉम्प्ट का समर्थन नहीं करता हो, प्रॉम्प्ट को उपयोगकर्ता संदेश के शीर्ष पर रखें

source: Enable Thinking
hi: सोचने की क्षमता सक्षम करें

source: Show thinking, disable it if your model does not support it
hi: सोचने की प्रक्रिया दिखाएँ, यदि आपका मॉडल इसका समर्थन नहीं करता है तो इसे अक्षम करें

source: Image Output
hi: छवि आउटपुट

source: Enable image output, only supported by gemini-2.0-flash-exp
hi: छवि आउटपुट सक्षम करें, केवल gemini-2.0-flash-exp द्वारा समर्थित

source: Enable safety settings
hi: सुरक्षा सेटिंग्स सक्षम करें

source: Enable google safety settings to avoid generating harmful content
hi: हानिकारक सामग्री उत्पन्न करने से बचने के लिए गूगल सुरक्षा सेटिंग्स सक्षम करें

source: Privacy Policy
hi: गोपनीयता नीति

source: Open privacy policy website
hi: गोपनीयता नीति वेबसाइट खोलें

source: Advanced Parameters
hi: उन्नत पैरामीटर

source: Enable advanced parameters
hi: उन्नत पैरामीटर सक्षम करें

source: RAM Required:
hi: RAM आवश्यक:

source: Parameters:
hi: पैरामीटर:

source: Size:
hi: आकार:

source: Model to use
hi: उपयोग करने के लिए मॉडल

source: Model Manager
hi: मॉडल प्रबंधक

source: List of models available
hi: उपलब्ध मॉडलों की सूची

source: API Key for
hi: के लिए API कुंजी

source: API Endpoint
hi: API एंडपॉइंट

source: API base url, change this to use interference APIs
hi: API बेस यूआरएल, इंटरफेरेंस API का उपयोग करने के लिए इसे बदलें

source: Use Custom Model
hi: कस्टम मॉडल का उपयोग करें

source: Use a custom model
hi: एक कस्टम मॉडल का उपयोग करें

source: Include parameters like Max Tokens, Top-P, Temperature, etc.
hi: अधिकतम टोकन, टॉप-पी, तापमान, आदि जैसे पैरामीटर शामिल करें।

source: Name of the LLM Model to use
hi: उपयोग करने के लिए LLM मॉडल का नाम

source: Model
hi: मॉडल

source: max Tokens
hi: अधिकतम टोकन

source: Max tokens of the generated text
hi: उत्पन्न टेक्स्ट के अधिकतम टोकन

source: Top-P
hi: टॉप-पी

source: An alternative to sampling with temperature, called nucleus sampling
hi: तापमान के साथ नमूनाकरण का एक विकल्प, जिसे न्यूक्लियस सैंपलिंग कहा जाता है

source: Temperature
hi: तापमान

source: What sampling temperature to use. Higher values will make the output more random
hi: किस नमूनाकरण तापमान का उपयोग करना है। उच्च मान आउटपुट को अधिक यादृच्छिक बना देंगे

source: Frequency Penalty
hi: आवृत्ति दंड

source: Number between -2.0 and 2.0. Positive values decrease the model's likelihood to repeat the same line verbatim
hi: संख्या -2.0 और 2.0 के बीच। सकारात्मक मान मॉडल की उसी पंक्ति को शब्दशः दोहराने की संभावना को कम करते हैं

source: Presence Penalty
hi: उपस्थिति दंड

source: Number between -2.0 and 2.0. Positive values decrease the model's likelihood to talk about new topics
hi: संख्या -2.0 और 2.0 के बीच। सकारात्मक मान मॉडल की नए विषयों के बारे में बात करने की संभावना को कम करते हैं

source: Max Tokens
hi: अधिकतम टोकन

source: The maximum number of tokens to generate
hi: उत्पन्न करने के लिए टोकन की अधिकतम संख्या

source: Choose providers based on pricing/throughput or latency
hi: कीमत/थ्रूपुट या विलंबता के आधार पर प्रदाताओं को चुनें

source: Price
hi: कीमत

source: Throughput
hi: थ्रूपुट

source: Latency
hi: विलंबता

source: Add order of providers to use, names separated by a comma. Empty to not specify
hi: उपयोग किए जाने वाले प्रदाताओं का क्रम जोड़ें, नामों को कॉमा से अलग करें। निर्दिष्ट न करने के लिए खाली छोड़ें

source: Allow Fallbacks
hi: फॉलबैक की अनुमति दें

source: Allow fallbacks to other providers
hi: अन्य प्रदाताओं पर फॉलबैक की अनुमति दें

source: Automatically Serve
hi: स्वचालित रूप से सर्व करें

source: Automatically run ollama serve in background when needed if it's not running. You can kill it with killall ollama
hi: जब आवश्यकता हो तो पृष्ठभूमि में स्वचालित रूप से ollama serve चलाएं यदि यह नहीं चल रहा है। आप इसे killall ollama से समाप्त कर सकते हैं

source: Custom Model
hi: कस्टम मॉडल

source: Ollama Model
hi: Ollama मॉडल

source: Name of the Ollama Model
hi: Ollama मॉडल का नाम

source: Add custom model
hi: कस्टम मॉडल जोड़ें

source: Add any model to this list by putting name:size Or any gguf from hf with hf.co/username/model
hi: नाम:आकार डालकर इस सूची में कोई भी मॉडल जोड़ें या hf.co/उपयोगकर्ता नाम/मॉडल के साथ hf से कोई भी gguf

source: Index your documents
hi: अपने दस्तावेज़ों को इंडेक्स करें

source: Index all the documents in your document folder. You have to run this operation every time you edit/create a document, change document analyzer or change embedding model
hi: अपने दस्तावेज़ फ़ोल्डर में सभी दस्तावेज़ों को इंडेक्स करें। आपको यह ऑपरेशन हर बार चलाना होगा जब आप किसी दस्तावेज़ को संपादित/बनाते हैं, दस्तावेज़ विश्लेषक बदलते हैं या एम्बेडिंग मॉडल बदलते हैं

source: API Key for Groq SR, write 'default' to use the default one
hi: Groq SR के लिए API कुंजी, डिफ़ॉल्ट वाली का उपयोग करने के लिए 'default' लिखें

source: Groq Model
hi: Groq मॉडल

source: Name of the Groq Model
hi: Groq मॉडल का नाम

source: Language
hi: भाषा

source: Specify the language for transcription. Use ISO 639-1 language codes (e.g. "en" for English, "fr" for French, etc.).
hi: ट्रांसक्रिप्शन के लिए भाषा निर्दिष्ट करें। ISO 639-1 भाषा कोड का उपयोग करें (जैसे अंग्रेजी के लिए "en", फ्रेंच के लिए "fr", आदि)।

source: Could not understand the audio
hi: ऑडियो समझ नहीं आया

source: Name of the Whisper model
hi: व्हिस्पर मॉडल का नाम

source: API Key for Google SR, write 'default' to use the default one
hi: गूगल SR के लिए API कुंजी, डिफ़ॉल्ट वाली का उपयोग करने के लिए 'default' लिखें

source: The language of the text to recgnize in IETF
hi: IETF में पहचानने के लिए टेक्स्ट की भाषा

source: Server Access Token for wit.ai
hi: wit.ai के लिए सर्वर एक्सेस टोकन

source: Model Path
hi: मॉडल पथ

source: Absolute path to the VOSK model (unzipped)
hi: VOSK मॉडल का पूर्ण पथ (अनज़िप किया हुआ)

source: Endpoint for OpenAI requests
hi: OpenAI अनुरोधों के लिए एंडपॉइंट

source: API Key for OpenAI
hi: OpenAI के लिए API कुंजी

source: Whisper Model
hi: व्हिस्पर मॉडल

source: Name of the OpenAI model
hi: OpenAI मॉडल का नाम

source: Optional: Specify the language for transcription. Use ISO 639-1 language codes (e.g. "en" for English, "fr" for French, etc.).
hi: वैकल्पिक: ट्रांसक्रिप्शन के लिए भाषा निर्दिष्ट करें। ISO 639-1 भाषा कोड का उपयोग करें (जैसे अंग्रेजी के लिए "en", फ्रेंच के लिए "fr", आदि)।

source: Max Results
hi: अधिकतम परिणाम

source: Number of results to consider
hi: विचार करने के लिए परिणामों की संख्या

source: Region
hi: क्षेत्र

source: Region for the search results
hi: खोज परिणामों के लिए क्षेत्र

source: Tavily API key
hi: टैविली एपीआई कुंजी

source: The depth of the search
hi: खोज की गहराई

source: The depth of the search. Advanced search is tailored to retrieve the most relevant sources and content snippets for your query, while basic search provides generic content snippets from each source. A basic search costs 1 API Credit, while an advanced search costs 2 API Credits.
hi: खोज की गहराई। उन्नत खोज आपकी क्वेरी के लिए सबसे प्रासंगिक स्रोतों और सामग्री स्निपेट्स को पुनः प्राप्त करने के लिए तैयार की गई है, जबकि बुनियादी खोज प्रत्येक स्रोत से सामान्य सामग्री स्निपेट्स प्रदान करती है। एक बुनियादी खोज में 1 API क्रेडिट खर्च होता है, जबकि एक उन्नत खोज में 2 API क्रेडिट खर्च होते हैं।

source: The category of the search
hi: खोज की श्रेणी

source: The category of the search. News is useful for retrieving real-time updates, particularly about politics, sports, and major current events covered by mainstream media sources. General is for broader, more general-purpose searches that may include a wide range of sources.
hi: खोज की श्रेणी। समाचार वास्तविक समय के अपडेट प्राप्त करने के लिए उपयोगी है, विशेष रूप से राजनीति, खेल और मुख्यधारा के मीडिया स्रोतों द्वारा कवर की गई प्रमुख वर्तमान घटनाओं के बारे में। सामान्य व्यापक, अधिक सामान्य-उद्देश्य वाली खोजों के लिए है जिसमें स्रोतों की एक विस्तृत श्रृंखला शामिल हो सकती है।

source: Chunks per source
hi: प्रति स्रोत चंक्स

source: The number of content chunks to retrieve from each source. Each chunk's length is maximum 500 characters. Available only when search depth is advanced.
hi: प्रत्येक स्रोत से पुनः प्राप्त करने के लिए सामग्री चंक्स की संख्या। प्रत्येक चंक की लंबाई अधिकतम 500 वर्ण है। केवल तभी उपलब्ध है जब खोज की गहराई उन्नत हो।

source: Number of days back from the current date to include
hi: वर्तमान तिथि से कितने दिन पीछे शामिल करें

source: Available only if topic is news.
hi: केवल तभी उपलब्ध है जब विषय समाचार हो।

source: Include answer
hi: उत्तर शामिल करें

source: Include an LLM-generated answer to the provided query. Basic search returns a quick answer. Advanced returns a more detailed answer.
hi: प्रदान की गई क्वेरी का LLM-जनित उत्तर शामिल करें। बुनियादी खोज एक त्वरित उत्तर देती है। उन्नत खोज एक अधिक विस्तृत उत्तर देती है।

source: Include raw content
hi: कच्ची सामग्री शामिल करें
